app/modules/crawling.rb

	def self.auto_crawling
		all_urls = get_all_urls_by_selenium

		all_urls.each do|url|
			course = parse_html(url)
			new_course = Course.new(title: course['title'], url: course['url'])
			new_course.save

			course_id = Course.find_by(url: course['url'].downcase).id
			new_sale = Sale.new(price: course['price'], student_count: course['student_count'], update_at: Time.now.strftime("%Y-%m-%d"), course_id: course_id)
			new_sale.save
---
INSERT INTO "sales" ("price", "student_count", "update_at", "course_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 0], ["student_count", 3108], ["update_at", "2018-08-01"], ["course_id", 1]]