app/modules/inflearn_crawling.rb

   def self.inflearn_crawling
      all_urls = get_all_urls_by_selenium

      all_urls.each do |url|
         course = parse_html(url)
         new_course = Course.new(title: course['title'],
                                 url: course['url'],
                                 site: "inflearn")
         new_course.save

         course_id = Course.find_by(url: course['url'].downcase).id
         prev_student_count = Sale.find_by(course_id: course_id, update_at: Date.yesterday)
         if prev_student_count
            daily_revenue = (course['student_count'].to_i - prev_student_count.student_count.to_i) * course['price'].to_i
            new_sale = Sale.new(price: course['price'],
                                student_count: course['student_count'],
                                update_at: Time.now.strftime("%Y-%m-%d"),
                                daily_revenue: daily_revenue,
                                course_id: course_id)
         else
            new_sale = Sale.new(price: course['price'],
                                student_count: course['student_count'],
                                update_at: Time.now.strftime("%Y-%m-%d"),
                                course_id: course_id)
         end

         new_sale.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."url" = $1 LIMIT $2  [["url", "https://www.inflearn.com/course/%ec%83%9d%ed%99%9c%ec%bd%94%eb%94%a9-jquery-%ea%b0%95%ec%a2%8c/"], ["LIMIT", 1]]
SELECT  "sales".* FROM "sales" WHERE "sales"."course_id" = $1 AND "sales"."update_at" = $2 LIMIT $3  [["course_id", 322], ["update_at", "2018-08-21"], ["LIMIT", 1]]
INSERT INTO "sales" ("price", "student_count", "update_at", "course_id", "daily_revenue") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 0], ["student_count", 1603], ["update_at", "2018-08-22"], ["course_id", 322], ["daily_revenue", 0]]